roboter/Hardware/WCH/ch32v003f4p6-SignalGenerator/source/SSD1306WCH/ssd1306.c
    // Configure PD0 (SDA) and PD1 (SCL) as open-drain alternate function
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOD, &GPIO_InitStructure);

    #elif I2C_MAP == 2
    // Remap I2C pins to PC6 (SDA) and PC5 (SCL)
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);
    AFIO->PCFR1 |= AFIO_PCFR1_I2C1_REMAP2; // Remap I2C1 to PC5/PC6

    // Configure PC6 (SDA) and PC5 (SCL) as open-drain alternate function
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_5;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    #else
    #warning "Wrong I2C_MAP configuration"
    #endif

    // Calculate I2C clock frequency
    uint32_t i2c_speed = I2C_CLKRATE;
    #ifndef F_CPU
    #define F_CPU 24000000 // Default 24MHz if not defined
    #endif

    // Configure I2C peripheral
    I2C_InitStructure.I2C_ClockSpeed = i2c_speed;
    I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
    I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
    I2C_InitStructure.I2C_OwnAddress1 = 0x00; // Not used in master mode
    I2C_InitStructure.I2C_Ack = I2C_Ack_Disable; // Disable acknowledge for write-only
    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;

    I2C_Init(I2C1, &I2C_InitStructure);
    I2C_Cmd(I2C1, ENABLE);
}


// Start I2C transmission (addr must contain R/W bit)
void I2C_start(uint8_t addr) {
    // Wait until bus ready
    while(I2C_GetFlagStatus(I2C1, I2C_FLAG_BUSY));
    
    // Generate START condition
    I2C_GenerateSTART(I2C1, ENABLE);
    
    // Wait for START condition generated
    while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT));
    
    // Send slave address + R/W bit
    I2C_SendData(I2C1, addr);
    
    // Wait for address transmitted
    while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED));
}

// Send data byte via I2C bus
void I2C_write(uint8_t data) {
    // Wait for data register empty
    while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTING));
    
    // Send data byte
    I2C_SendData(I2C1, data);
}

// Stop I2C transmission
void I2C_stop(void) {
    // Wait for byte transfer finished
    while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
    
    // Generate STOP condition
    I2C_GenerateSTOP(I2C1, ENABLE);
    
    // Wait for STOP condition completed
    while(I2C_GetFlagStatus(I2C1, I2C_FLAG_STOPF));
}

// Quick I2C scanner
void OLED_i2c_scan_quick(void) {
    uint8_t found = 0;
    
    OLED_clear();
    OLED_println("Quick I2C Scan");
    OLED_println("--------------");
    
    for(uint8_t addr = 0x08; addr < 0x78; addr++) {
        I2C_GenerateSTART(I2C1, ENABLE);
        while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT));
        
        I2C_Send7bitAddress(I2C1, addr, I2C_Direction_Transmitter);
        Delay_Ms(1);
        
        if(!I2C_GetFlagStatus(I2C1, I2C_FLAG_AF)) {
            OLED_setpos(0, 2 + found);
            OLED_print("0x");
            OLED_printB(addr << 1);
            found++;
        } else {
            I2C_ClearFlag(I2C1, I2C_FLAG_AF);
        }
        
        I2C_GenerateSTOP(I2C1, ENABLE);
        while(I2C_GetFlagStatus(I2C1, I2C_FLAG_STOPF));
    }
    
    OLED_setpos(0, 6);
    OLED_print("Found: ");
    OLED_printD(found);
}

// Diagnostic I2C scanner with detailed error reporting
void OLED_i2c_diagnose(void) {
    uint8_t found_devices = 0;
    uint16_t status1, status2;
    
    OLED_clear();
    OLED_println("I2C Diagnostic Scan");
    OLED_println("-------------------");
    
    for(uint8_t addr_7bit = 0x08; addr_7bit < 0x78; addr_7bit++) {
        // Generate START condition
        I2C_GenerateSTART(I2C1, ENABLE);
        
        // Wait for START with timeout
        uint32_t timeout = 100000;
        while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT)) {
            if(timeout-- == 0) {
                OLED_setpos(0, 2);
                OLED_print("START timeout");
                I2C_GenerateSTOP(I2C1, ENABLE);
                return;
            }
        }
        
        // Send address
        I2C_Send7bitAddress(I2C1, addr_7bit, I2C_Direction_Transmitter);
        
        // Short delay
        Delay_Ms(2);
        
        // Check status registers for detailed diagnostics
        status1 = I2C1->STAR1;
        status2 = I2C1->STAR2;
        
        if(!I2C_GetFlagStatus(I2C1, I2C_FLAG_AF)) {
            // Device found!
            found_devices++;
            OLED_setpos(0, 2 + (found_devices - 1) % 4);
            OLED_print("0x");
            OLED_printB(addr_7bit << 1);
        }
        else {
            // Check for specific errors
            if(status1 & I2C_STAR1_AF) {
                // Normal - no device at this address
                I2C_ClearFlag(I2C1, I2C_FLAG_AF);
            }
            
            if(status1 & I2C_STAR1_BERR) {
                OLED_setpos(0, 2);
                OLED_print("Bus Error!");
                I2C_ClearFlag(I2C1, I2C_FLAG_BERR);
            }
            
            if(status1 & I2C_STAR1_ARLO) {
                OLED_setpos(0, 3);
                OLED_print("Arbitration Lost!");
                I2C_ClearFlag(I2C1, I2C_FLAG_ARLO);
            }
        }
        
        // Generate STOP condition
        I2C_GenerateSTOP(I2C1, ENABLE);
        timeout = 100000;
        while(I2C_GetFlagStatus(I2C1, I2C_FLAG_STOPF)) {
            if(timeout-- == 0) break;
        }
        
        Delay_Ms(1);
    }
    
    // Display results
    OLED_setpos(0, 6);
    OLED_print("Found: ");
    OLED_printD(found_devices);
    OLED_print(" devices");
    
    if(found_devices == 0) {
        OLED_setpos(0, 7);
        OLED_print("Check wiring/pullups");
    }
    
    Delay_Ms(3000);
}

// Test connection to specific address
uint8_t OLED_test_oled_connection(void) {
  
    printf("Testing OLED connection");
    printf("-----------------------");
    
