roboter/Hardware/WCH/ch32v003f4p6-SignalGenerator/source/SSD1306WCH/ssd1306.c
    // Try common OLED addresses

    uint8_t found_addr = 0;
    
    for(int i = 0; i < 128; i++) {
        
        printf("Trying ");
        printf("0x%02X",i );
        
        I2C_GenerateSTART(I2C1, ENABLE);
        uint32_t timeout = 1000;
        while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT)) {
            if(timeout-- == 0) {
                printf(" START FAIL");
                I2C_GenerateSTOP(I2C1, ENABLE);
                continue;
            }
        }
        
        I2C_Send7bitAddress(I2C1, i, I2C_Direction_Transmitter);
        Delay_Ms(2);
        
        if(!I2C_GetFlagStatus(I2C1, I2C_FLAG_AF)) {
            printf(" FOUND!\n");
            found_addr = i;
        } else {
            printf(" No response\n");
            I2C_ClearFlag(I2C1, I2C_FLAG_AF);
        }
        
        I2C_GenerateSTOP(I2C1, ENABLE);
        timeout = 1000;
        while(I2C_GetFlagStatus(I2C1, I2C_FLAG_STOPF)) {
            if(timeout-- == 0) break;
        }
        
       // Delay_Ms(500);
    }
    
    return found_addr;
}

// Test connection to all addresses and display results in a table
void OLED_test_all_addresses(void) {
    uint8_t found_addresses[128] = {0};
    uint8_t found_count = 0;
    
    OLED_clear();
    OLED_println("I2C Address Scan");
    OLED_println("----------------");
    
    // Scan all 128 possible addresses
    for(uint8_t i = 0; i < 128; i++) {
        I2C_GenerateSTART(I2C1, ENABLE);
        uint32_t timeout = 1000;
        
        // Wait for START condition
        while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT)) {
            if(timeout-- == 0) {
                I2C_GenerateSTOP(I2C1, ENABLE);
                break;
            }
        }
        
        if(timeout > 0) { // START was successful
            I2C_Send7bitAddress(I2C1, i, I2C_Direction_Transmitter);
            Delay_Ms(1);
            
            if(!I2C_GetFlagStatus(I2C1, I2C_FLAG_AF)) {
                found_addresses[found_count++] = i;
            } else {
                I2C_ClearFlag(I2C1, I2C_FLAG_AF);
            }
        }
        
        I2C_GenerateSTOP(I2C1, ENABLE);
        timeout = 1000;
        while(I2C_GetFlagStatus(I2C1, I2C_FLAG_STOPF)) {
            if(timeout-- == 0) break;
        }
    }
    
    // Display results in a table format
    OLED_clear();
    OLED_println("I2C Devices Found:");
    OLED_println("7-bit  8-bit(W)");
    OLED_println("-----  ---------");
    
    uint8_t line = 3; // Start from line 3
    for(uint8_t i = 0; i < found_count; i++) {
        if(line >= 8) break; // Don't exceed display height
        
        OLED_setpos(0, line);
        
        // Display 7-bit address
        OLED_print("0x");
        if(found_addresses[i] < 0x10) OLED_print("0");
        OLED_printB(found_addresses[i]);
        
        // Display 8-bit write address
        OLED_setpos(7, line);
        OLED_print("0x");
        OLED_printB(found_addresses[i] << 1);
        
        line++;
    }
    
    // Display summary at the bottom
    OLED_setpos(0, 7);
    OLED_print("Total: ");
    OLED_printD(found_count);
    OLED_print(" devices");
    
    Delay_Ms(5000); // Display for 5 seconds
    
    // Return to top and show detailed info
    if(found_count > 0) {
        OLED_clear();
        OLED_println("Device Details:");
        OLED_println("---------------");
        
        for(uint8_t i = 0; i < found_count && i < 3; i++) {
            OLED_setpos(0, 2 + i);
            OLED_print("0x");
            OLED_printB(found_addresses[i] << 1);
            OLED_print(" (7-bit: 0x");
            OLED_printB(found_addresses[i]);
            OLED_print(")");
        }
        
        if(found_count > 3) {
            OLED_setpos(0, 6);
            OLED_print("+");
            OLED_printD(found_count - 3);
            OLED_print(" more...");
        }
        
        Delay_Ms(3000);
    }
}